Revit 2024 API
Element.GetExternalResourceReferencesExpanded Method
 Gets the expanded map of the external resource references referenced by the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public IDictionary<ExternalResourceType, IList<ExternalResourceReference>> GetExternalResourceReferencesExpanded()
Visual Basic
Public Function GetExternalResourceReferencesExpanded As IDictionary(Of ExternalResourceType, IList(Of ExternalResourceReference))
Visual C++
public:
IDictionary<ExternalResourceType^, IList<ExternalResourceReference^>^>^ GetExternalResourceReferencesExpanded()
Return Value
 The expanded map of the external resource references referenced by the element.
Remarks
 The value includes all external resource references under the type. Use this API for an element which has multiple external resource references under a specified type, e.g., AppearanceAssetElement. See also: [!:Autodesk::Revit::DB::Element::getExternalResourceReferences].
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This Element does not use any external resource.
See Also
Element Class
Autodesk.Revit.DB Namespace